//
//  ClipboardModel.swift
//  clipbee
//
//  Created by nacika on 2014/06/14.
//  Copyright (c) 2014年 nacika. All rights reserved.
//

import Cocoa



class ClipboardModel: Model {
    
    
    /// シングルトン
    //-------------------------------------------------------------------------------
    class var sharedInstance : ClipboardModel
        {
    struct Singleton {
        static let instance = ClipboardModel()
        }
        return Singleton.instance
    }
    
    /// インスタンスの取得
    //-------------------------------------------------------------------------------
    var clipCon = ClipboardController.sharedInstance
    
    /// 初期化
    //-------------------------------------------------------------------------------
    init() {
        
        
        /// デバッグ
        //-------------------------------------------------------------------------------
        // println("ClipboardModelが初期化されました")
        
        /// インスタンス生成
        //-------------------------------------------------------------------------------
        super.init()
        
        /// デバッグ
        //-------------------------------------------------------------------------------
        // println(clipboardModelSharedInstanceVariable)
    }
    
    /// クリップボードの監視を行う
    //-------------------------------------------------------------------------------
    func clipboardCaptureStart() -> Bool {
    
        /// デバッグ
        //-------------------------------------------------------------------------------
        println("クリップボードの監視を開始しました")
        
        /// スレッド作成
        //-------------------------------------------------------------------------------
        // NSThread.detachNewThreadSelector("clipboardWatcher:", toTarget:self, withObject:nil)
        
        /// スレッド作成
        //-------------------------------------------------------------------------------
        var nst = NSThread(target:self, selector:"clipboardWatcher", object:nil)
        nst.start()
        
        return true
    
    }
    
    /// クリップボード監視処理
    //-------------------------------------------------------------------------------
    func clipboardWatcher() {
        
        var loopCount = 0;
        
        /// デバッグ
        //-------------------------------------------------------------------------------
        println("スレッドが起動しました")
        
        while(true) {
            
            /// ループカウント
            //-------------------------------------------------------------------------------
            loopCount += 1;
            
            /// デバッグ
            //-------------------------------------------------------------------------------
            println("スレッドループ処理中です \(loopCount)")
            
            /// クリップボード履歴の取得
            //-------------------------------------------------------------------------------
            var clipText = self.clipCon.pasteBoardText()
            
            
            /// 処理の待機
            //-------------------------------------------------------------------------------
            NSThread.sleepForTimeInterval(1.0)
        }
    }


}
