//
//  ClipboardModel.swift
//  clipbee
//
//  Created by nacika on 2014/06/14.
//  Copyright (c) 2014年 nacika. All rights reserved.
//

import Cocoa



class ClipboardModel: Model {
    
    /// initで呼ばれたタイミンºグではまだnilになっているため、nilを許容します。
    //-------------------------------------------------------------------------------
    var text: String?
    
    /// 作成日
    //-------------------------------------------------------------------------------
    var createdAt: NSDate?
    
    /// 更新日
    //-------------------------------------------------------------------------------
    var updatedAt: NSDate?
    
    /// タイトル
    //-------------------------------------------------------------------------------
    var title: String?
    
    //// ロックされているかどうか
    //-------------------------------------------------------------------------------
    var isProtect: Bool?
    
    /// super.initで呼ばれる初期化。この初期化は super.init()で呼ばれます。
    //-------------------------------------------------------------------------------
    init(_ text: String) {
        
        /// ディクショナリからデータを取得しインスタンスを初期化します。
        //-------------------------------------------------------------------------------
        println("2. インスタンスを初期化します。")
        
        /// 現在時刻の取得
        //-------------------------------------------------------------------------------
        println("日付の取得1")
        var nowTime: NSDate = NSDate()
        println("日付の取得2")
        var updateTime: NSDate = NSDate( timeInterval:0, sinceDate:nowTime )
        println("日付の取得3")
        self.text = String(text)
        println("現在時刻の取得")
        
        /// 作成日
        //-------------------------------------------------------------------------------
        self.createdAt = nowTime
        println("作成日の取得")
        
        /// 更新日
        //-------------------------------------------------------------------------------
        self.updatedAt = updateTime
        println("更新日の取得")
        
        /// ロックされていないデータ
        //-------------------------------------------------------------------------------
        self.isProtect = false
        
    }
    
    //// インスタンスの追加
    //-------------------------------------------------------------------------------
    class func create (text: String) -> ClipboardModel {
        
        /// インスタンスの作成
        //-------------------------------------------------------------------------------
        var i = ClipboardModel(text)
        
        /// インスタンスの生成 （）
        //-------------------------------------------------------------------------------
        return i
        
    }
}
